## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_5am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_5am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 5am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-day-at-5am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 10 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.run_nagware_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_nagware_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-5am"
      + target_id      = (known after apply)
    }

  # aws_lambda_function.nagware will be created
  + resource "aws_lambda_function" "nagware" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/nagware_main.zip"
      + function_name                  = "Nagware"
      + handler                        = "nagware.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "jBFhTMBF1ekmN1dc+v31m02rfHXUp8gnXpGiab++s+c="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_ARN"                    = "arn:aws:rds:ca-central-1:687401027353:cluster:forms-staging-db-cluster"
              + "DB_NAME"                   = "forms"
              + "DB_SECRET"                 = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:database-secret-vHJuTe"
              + "DYNAMODB_VAULT_TABLE_NAME" = "Vault"
              + "ENVIRONMENT"               = "staging"
              + "NOTIFY_API_KEY"            = (sensitive)
              + "REGION"                    = "ca-central-1"
              + "SNS_ERROR_TOPIC_ARN"       = "arn:aws:sns:ca-central-1:687401027353:alert-critical"
              + "TEMPLATE_ID"               = "8d597a1b-a1d6-4e3c-8421-042a2b4158b7"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.nagware_lib will be created
  + resource "aws_lambda_layer_version" "nagware_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/nagware_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "nagware_lib_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "sRfx49+cHV1uwu6/vBoa7FBHiC2loICwlwnyuvw/D5Y="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.nagware_nodejs will be created
  + resource "aws_lambda_layer_version" "nagware_nodejs" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/nagware_nodejs.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "nagware_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "+vuWT73yVliSjisGd9+W4KUDnX4ZYG8yc4UzlYXR1Tk="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_nagware_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Nagware"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_role.s3_scan_object"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
